//;******************************************************************************
//;* Copyright (c) 1983-2014, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
// *++
//
// Module Name:
//
//   SecureBootMgrStrings.vfr
//
// Abstract:
//
//   String definitions for Secure Boot Manager Utility.
//
// Revision History:
//
// --*/

/=#

#include "Standard.uni"


#string STR_ADMINISTER_SECURE_BOOT_TITLE      #language en-US  "Administer Secure Boot"
                                              #language fr-FR  "Administer Secure Boot"
#string STR_SYSTEM_STATUS_BANNER              #language en-US  "System Status:"
                                              #language fr-FR  "System Status:"
#string STR_SB_NULL_STRING                    #language en-US  " "
                                              #language fr-FR  " "
#string STR_SECURE_BOOT_DATABASE              #language en-US  "Secure Boot Database"
                                              #language fr-FR  "Secure Boot Database"
#string STR_UNLOCKED                          #language en-US  "Unlocked"
                                              #language fr-FR  "Unlocked"
#string STR_INSTALLED_AND_LOCKED              #language en-US  "Installed and Locked"
                                              #language fr-FR  "Installed and Locked"
#string STR_SECURE_BOOT_STATUS                #language en-US  "Secure Boot Status"
                                              #language fr-FR  "Secure Boot Status"
#string STR_CUSTOM_SECURITY                   #language en-US  "User Customized Security"
                                              #language fr-FR  "User Customized Security"
#string STR_YES                               #language en-US  "YES"
                                              #language fr-FR  "YES"
#string STR_NO                                #language en-US  "NO"
                                              #language fr-FR  "NO"
#string STR_SB_OPTIONS_STRING                 #language en-US  "Options:"
                                              #language fr-FR  "Options:"
#string STR_ENROLL_HASH_STRING                #language en-US  "Select a UEFI file as trusted for execution"
                                              #language fr-FR  "Select a UEFI file as trusted for execution"
#string STR_ENROLL_HASH_HELP                  #language en-US  "Add sepecific EFI image hash to allowed database."
                                              #language fr-FR  "Add sepecific EFI image hash to allowed database."
#string STR_SECURE_BOOT_STRING                #language en-US  "Enforce Secure Boot"
                                              #language fr-FR  "Enforce Secure Boot"
#string STR_SECURE_BOOT_HELP                  #language en-US  "Select Disable to Suspend enforcement of Secure Boot Checks."
                                              #language fr-FR  "Select Disable to Suspend enforcement of Secure Boot Checks."
#string STR_CLEAR_SECURE_SETTINGS_STRING      #language en-US  "Erase all Secure Boot Settings"
                                              #language fr-FR  "Erase all Secure Boot Settings"
#string STR_CLEAR_SECURE_SETTINGS_HELP        #language en-US  "Enable this option will erase all Secure Boot Settings. This action will clear four varialbes PK, KEK, db, and dbx."
                                              #language fr-FR  "Enable this option will erase all Secure Boot Settings. This action will clear four varialbes PK, KEK, db, and dbx."
#string STR_FACTORY_SETTINGS_STRING           #language en-US  "Restore Secure Boot to Factory Settings"
                                              #language fr-FR  "Restore Secure Boot to Factory Settings"
#string STR_FACTORY_SETTINGS_HELP             #language en-US  "Restore all of the Secure Boot Settings to default factory settings and enable Secure Boot."
                                              #language fr-FR  "Restore all of the Secure Boot Settings to default factory settings and enable Secure Boot."
#string STR_BACKUP_SETTINGS_STRING            #language en-US  "Restore Secure Boot to Backup Settings"
                                              #language fr-FR  "Restore Secure Boot to Backup Settings"
#string STR_BACKUP_SETTINGS_HELP              #language en-US  "Restore all of the secure boot Settings to backup factory settings and enable Secure Boot."
                                              #language fr-FR  "Restore all of the secure boot Settings to backup factory settings and enable Secure Boot."
#string STR_SB_DISABLED_TEXT                  #language en-US  "Disabled"
                                              #language fr-FR  "Désactiver"
#string STR_SB_ENABLED_TEXT                   #language en-US  "Enabled"
                                              #language fr-FR  "Activer"
#string STR_OPERATION_FINISH_MESSAGE          #language en-US  "Operation is completed. System will reset!!"
                                              #language fr-FR  "Operation is completed. System will reset!!"
#string STR_FORMATE_INCORRECT_MESSAGE         #language en-US  "This isn't a vaild EFI image. Please select another file!!"
                                              #language fr-FR  "This isn't a vaild EFI image. Please select another file!!"
#string STR_ADD_HASH_MESSAGE                  #language en-US  "Add this hash image to allowed database (db)"
                                              #language fr-FR  "Add this hash image to allowed database (db)"
#string STR_EXIT_MENU_STRING                  #language en-US  "Exit Discarding Change"
                                              #language fr-FR  "Exit Discarding Change"
#string STR_SAVE_CHANGE_STRING                #language en-US  "Exit saving changes"
                                              #language fr-FR  "Exit saving changes"
#string STR_FILE_NOT_FOUND_MESSAGE            #language en-US  "Cannot find file!!"
                                              #language fr-FR  "Cannot find file!!"
